АлогистикТест2/src/Documents/алк_ОценкаСырья/алк_ОценкаСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ОценкаСырья</name>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоКондиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборШтабеля</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузитьЕРП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтанцияОтправления</name>
      <type>
        <types>CatalogRef.алк_ЛогистическиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТранспортировки</name>
      <type>
        <types>EnumRef.алк_ВидыТранспортировки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВагона</name>
      <comment>Номер вагона/автомобиля</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <comment>Номер ЖД накладной</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Некондиция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.Градации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_УчетЛесопродукцииГОСТ/алк_УчетЛесопродукцииГОСТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_УчетЛесопродукцииГОСТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ГрадацииСечений/алк_ГрадацииСечений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ГрадацииСечений</name>
  <resources>
    <name>Градация</name>
    <type>
      <types>CatalogRef.Градации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ЦеныНаЛесопродукциюТД/алк_ЦеныНаЛесопродукциюТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ЦеныНаЛесопродукциюТД</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Градация</name>
    <type>
      <types>CatalogRef.Градации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Некондиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_ОценкаСырья/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодПриемки.ДатаНачала    = Объект.ДатаС;
	ПериодПриемки.ДатаОкончания = Объект.ДатаПо;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДатаС    = ПериодПриемки.ДатаНачала;
	Объект.ДатаПо = ПериодПриемки.ДатаОкончания;
	
КонецПроцедуры


#КонецОбласти 


#Область ОбработкаКомманд

&НаСервере
Процедура ЗаполнитьПродукциюНаСервере(ОтборПоСертификатуПроизводителя, ОтборПоСертификату)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УчетЛесопродукцииГОСТОбороты.СтруктурнаяЕдиница,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель,
		|	алк_УчетЛесопродукцииГОСТОбороты.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ГрадацииСечений.Градация КАК Градация,
		|	алк_УчетЛесопродукцииГОСТОбороты.КоличествоПриход КАК Количество,
		|	алк_УчетЛесопродукцииГОСТОбороты.ОбъемПриход КАК Объем,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор КАК Партия,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.СтанцияОтправления КАК СтанцияОтправления,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.ВидТранспортировки КАК ВидТранспортировки,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерВагона КАК НомерВагона,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерНакладной КАК НомерНакладной,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель.Несоответствие КАК Некондиция
		|ПОМЕСТИТЬ втПродукция
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииГОСТ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Штабель.Несоответствие В (&П1)
		|				И (Штабель В (&П2)
		|					ИЛИ &ВсеШтабели)) КАК алк_УчетЛесопродукцииГОСТОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
		|			ПО алк_ПараметрыХарактеристик.Сечение = алк_ГрадацииСечений.Сечение
		|		ПО алк_УчетЛесопродукцииГОСТОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.СтанцияОтправления = &СтанцияОтправления
		|	И алк_УчетЛесопродукцииГОСТОбороты.Регистратор.Производитель = &Производитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.Цена,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтавкаНДС,
		|	СУММА(втПродукция.Объем * алк_ЦеныНаЛесопродукциюТДСрезПоследних.СуммаНДС) КАК СуммаНДС,
		|	СУММА(втПродукция.Объем * алк_ЦеныНаЛесопродукциюТДСрезПоследних.Всего) КАК Сумма,
		|	втПродукция.СтруктурнаяЕдиница,
		|	втПродукция.Штабель,
		|	втПродукция.Номенклатура КАК Номенклатура,
		|	втПродукция.Порода,
		|	втПродукция.Сорт КАК Сорт,
		|	втПродукция.Длина КАК Длина,
		|	втПродукция.Градация КАК Градация,
		|	СУММА(втПродукция.Количество) КАК Количество,
		|	СУММА(втПродукция.Объем) КАК Объем,
		|	втПродукция.Партия КАК Партия,
		|	втПродукция.СтанцияОтправления,
		|	втПродукция.ВидТранспортировки,
		|	втПродукция.НомерВагона,
		|	втПродукция.НомерНакладной,
		|	втПродукция.Некондиция,
		|	втПродукция.Партия.Сертификат КАК Сертификат,
		|	втПродукция.Партия.СертификатПроизводителя КАК СертификатПроизводителя
		|ИЗ
		|	втПродукция КАК втПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ЦеныНаЛесопродукциюТД.СрезПоследних КАК алк_ЦеныНаЛесопродукциюТДСрезПоследних
		|		ПО втПродукция.Номенклатура = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Номенклатура
		|			И втПродукция.Порода = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Порода
		|			И втПродукция.Сорт = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Сорт
		|			И втПродукция.Длина = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Длина
		|			И втПродукция.Градация = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Градация
		|			И втПродукция.Некондиция = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Некондиция
		|			И втПродукция.СтанцияОтправления = алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтанцияОтправления
		|			И втПродукция.ВидТранспортировки = алк_ЦеныНаЛесопродукциюТДСрезПоследних.ВидТранспортировки
		|
		|СГРУППИРОВАТЬ ПО
		|	втПродукция.Штабель,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтавкаНДС,
		|	втПродукция.Номенклатура,
		|	втПродукция.СтруктурнаяЕдиница,
		|	втПродукция.Сорт,
		|	втПродукция.Порода,
		|	втПродукция.НомерВагона,
		|	втПродукция.Длина,
		|	втПродукция.СтанцияОтправления,
		|	втПродукция.Партия,
		|	втПродукция.Градация,
		|	втПродукция.НомерНакладной,
		|	втПродукция.ВидТранспортировки,
		|	втПродукция.Некондиция,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.Цена,
		|	втПродукция.Партия.Сертификат
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партия,
		|	Номенклатура,
		|	Длина,
		|	Градация,
		|	Сорт
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Запрос.УстановитьПараметр("НачалоПериода", ПериодПриемки.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодПриемки.ДатаОкончания);
	
	Запрос.УстановитьПараметр("Производитель", Объект.Производитель);
	Запрос.УстановитьПараметр("СтанцияОтправления", Объект.СтанцияОтправления);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	Сп = Новый СписокЗначений;
	Сп.Добавить(Истина);
	Сп.Добавить(Ложь);
	
	Запрос.УстановитьПараметр("П1", ?(Объект.ТолькоКондиция, Ложь, Сп));
	Запрос.УстановитьПараметр("П2", Объект.ОтборШтабеля);
	Запрос.УстановитьПараметр("ВсеШтабели", ?(ЗначениеЗаполнено(Объект.ОтборШтабеля), Ложь, Истина));	

	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(ОтборПоСертификатуПроизводителя) Тогда
		
		Отбор = Новый Структура("СертификатПроизводителя", ОтборПоСертификатуПроизводителя);
		ТЗ_0 = РезультатЗапроса.Выгрузить();
		ТЗ = ТЗ_0.Скопировать(Отбор);

	ИначеЕсли ЗначениеЗаполнено(ОтборПоСертификату) Тогда
		
		Отбор = Новый Структура("Сертификат", ОтборПоСертификату);
		ТЗ_0 = РезультатЗапроса.Выгрузить();
		ТЗ = ТЗ_0.Скопировать(Отбор);

		
		ТЗ = РезультатЗапроса.Выгрузить();
	Иначе
		ТЗ = РезультатЗапроса.Выгрузить();
	КонецЕсли; 
	
	Объект.Продукция.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродукцию(Команда)
	ЗаполнитьПродукциюНаСервере(ОтборПоСертификатуПроизводителя, ОтборПоСертификату);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродукцияПоСтаройСхеме(Команда)
	ЗаполнитьПродукцияПоСтаройСхемеНаСервере(ОтборПоСертификатуПроизводителя, ОтборПоСертификату);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПродукцияПоСтаройСхемеНаСервере(ОтборПоСертификатуПроизводителя, ОтборПоСертификату)  
	
	//20241224 - нужно один раз для КЛПХ заполнить до 11.12
	Если Объект.Производитель <> Справочники.Контрагенты.НайтиПоКоду("ПБ-000148") Тогда 
		Сообщить("Оформить по старой схеме можно только КЛПХ до 11.12.2024!");
		Возврат;
	КонецЕсли; 
	//\\

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УчетЛесопродукцииГОСТОбороты.СтруктурнаяЕдиница,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель,
		|	алк_УчетЛесопродукцииГОСТОбороты.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ГрадацииСечений.Градация КАК Градация,
		|	алк_УчетЛесопродукцииГОСТОбороты.КоличествоПриход КАК Количество,
		|	алк_УчетЛесопродукцииГОСТОбороты.ОбъемПриход КАК Объем,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор КАК Партия,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.СтанцияОтправления КАК СтанцияОтправления,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.ВидТранспортировки КАК ВидТранспортировки,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерВагона КАК НомерВагона,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерНакладной КАК НомерНакладной,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель.Несоответствие КАК Некондиция
		|ПОМЕСТИТЬ втПродукция
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииГОСТ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Штабель.Несоответствие В (&П1)
		|				И (Штабель В (&П2)
		|					ИЛИ &ВсеШтабели)) КАК алк_УчетЛесопродукцииГОСТОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
		|			ПО алк_ПараметрыХарактеристик.Сечение = алк_ГрадацииСечений.Сечение
		|		ПО алк_УчетЛесопродукцииГОСТОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.СтанцияОтправления = &СтанцияОтправления
		|	И алк_УчетЛесопродукцииГОСТОбороты.Регистратор.Производитель = &Производитель
		|	И алк_УчетЛесопродукцииГОСТОбороты.Регистратор.Партия.Дата < &ДатаОтгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.Цена,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтавкаНДС,
		|	СУММА(втПродукция.Объем * алк_ЦеныНаЛесопродукциюТДСрезПоследних.СуммаНДС) КАК СуммаНДС,
		|	СУММА(втПродукция.Объем * алк_ЦеныНаЛесопродукциюТДСрезПоследних.Всего) КАК Сумма,
		|	втПродукция.СтруктурнаяЕдиница,
		|	втПродукция.Штабель,
		|	втПродукция.Номенклатура КАК Номенклатура,
		|	втПродукция.Порода,
		|	втПродукция.Сорт КАК Сорт,
		|	втПродукция.Длина КАК Длина,
		|	втПродукция.Градация КАК Градация,
		|	СУММА(втПродукция.Количество) КАК Количество,
		|	СУММА(втПродукция.Объем) КАК Объем,
		|	втПродукция.Партия КАК Партия,
		|	втПродукция.СтанцияОтправления,
		|	втПродукция.ВидТранспортировки,
		|	втПродукция.НомерВагона,
		|	втПродукция.НомерНакладной,
		|	втПродукция.Некондиция,
		|	втПродукция.Партия.Сертификат КАК Сертификат,
		|	втПродукция.Партия.СертификатПроизводителя КАК СертификатПроизводителя
		|ИЗ
		|	втПродукция КАК втПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ЦеныНаЛесопродукциюТД.СрезПоследних КАК алк_ЦеныНаЛесопродукциюТДСрезПоследних
		|		ПО втПродукция.Номенклатура = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Номенклатура
		|			И втПродукция.Порода = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Порода
		|			И втПродукция.Сорт = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Сорт
		|			И втПродукция.Длина = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Длина
		|			И втПродукция.Градация = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Градация
		|			И втПродукция.Некондиция = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Некондиция
		|			И втПродукция.СтанцияОтправления = алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтанцияОтправления
		|			И втПродукция.ВидТранспортировки = алк_ЦеныНаЛесопродукциюТДСрезПоследних.ВидТранспортировки
		|
		|СГРУППИРОВАТЬ ПО
		|	втПродукция.Штабель,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтавкаНДС,
		|	втПродукция.Номенклатура,
		|	втПродукция.СтруктурнаяЕдиница,
		|	втПродукция.Сорт,
		|	втПродукция.Порода,
		|	втПродукция.НомерВагона,
		|	втПродукция.Длина,
		|	втПродукция.СтанцияОтправления,
		|	втПродукция.Партия,
		|	втПродукция.Градация,
		|	втПродукция.НомерНакладной,
		|	втПродукция.ВидТранспортировки,
		|	втПродукция.Некондиция,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.Цена,
		|	втПродукция.Партия.Сертификат,
		|	втПродукция.Партия.СертификатПроизводителя
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партия,
		|	Номенклатура,
		|	Длина,
		|	Градация,
		|	Сорт
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Запрос.УстановитьПараметр("НачалоПериода", ПериодПриемки.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодПриемки.ДатаОкончания);
	//Запрос.УстановитьПараметр("ДатаОтгрузки", '20240610');
	Запрос.УстановитьПараметр("ДатаОтгрузки", '20241212');
	Запрос.УстановитьПараметр("Производитель", Объект.Производитель);
	Запрос.УстановитьПараметр("СтанцияОтправления", Объект.СтанцияОтправления);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	Сп = Новый СписокЗначений;
	Сп.Добавить(Истина);
	Сп.Добавить(Ложь);
	
	Запрос.УстановитьПараметр("П1", ?(Объект.ТолькоКондиция, Ложь, Сп));
	Запрос.УстановитьПараметр("П2", Объект.ОтборШтабеля);
	Запрос.УстановитьПараметр("ВсеШтабели", ?(ЗначениеЗаполнено(Объект.ОтборШтабеля), Ложь, Истина));	

	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(ОтборПоСертификатуПроизводителя) Тогда
		
		Отбор = Новый Структура("СертификатПроизводителя", ОтборПоСертификатуПроизводителя);
		ТЗ_0 = РезультатЗапроса.Выгрузить();
		ТЗ = ТЗ_0.Скопировать(Отбор);

	ИначеЕсли ЗначениеЗаполнено(ОтборПоСертификату) Тогда
		
		Отбор = Новый Структура("Сертификат", ОтборПоСертификату);
		ТЗ_0 = РезультатЗапроса.Выгрузить();
		ТЗ = ТЗ_0.Скопировать(Отбор);

		
		ТЗ = РезультатЗапроса.Выгрузить();
	Иначе
		ТЗ = РезультатЗапроса.Выгрузить();
	КонецЕсли; 
	
	Объект.Продукция.Загрузить(ТЗ);
	
КонецПроцедуры
	
#КонецОбласти
